loadtests/checkout-test.yml
config:
  target: "http://localhost:3000" #Adressen som load-testen skal sende request til
  phases:
    - duration: 30 #Testen kører i 30 sekunder
      arrivalRate: 8 #Sender 8 nye brugere per sekund

scenarios:
  - name: "Checkout GET + POST" #Navn på testen
    flow:
      - get:
          url: "/checkout" #Endpoint der testes

      - post:
          url: "/checkout" #Endpoint der testes
          json:
            navn: "Test Person"
            dato: "2025-01-01"
            tid: "12:00"
            aktivitet: "Bowling"
            antal: 2
            totalPris: 300
            telefon: "12345678"
            bemærkning: "Ingen"
            smsPaamindelse: 1